balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F2010E.PIC
        <edc:SFRDef edc:access="-nnn------------" edc:cname="IPC5" edc:desc="" edc:impl="0x7000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100------------" edc:name="IPC5" edc:nzwidth="0x10" edc:por="-100------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="12"/>
              <edc:SFRFieldDef edc:cname="INT2IP" edc:desc="" edc:mask="0x7" edc:name="INT2IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="12"/>
              <edc:SFRFieldDef edc:cname="INT2IP0" edc:desc="" edc:mask="0x1" edc:name="INT2IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2IP1" edc:desc="" edc:mask="0x1" edc:name="INT2IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2IP2" edc:desc="" edc:mask="0x1" edc:name="INT2IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="-nnn------------" edc:cname="IPC9" edc:desc="" edc:impl="0x7000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuu------------" edc:name="IPC9" edc:nzwidth="0x10" edc:por="-100------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="12"/>
              <edc:SFRFieldDef edc:cname="PWMIP" edc:desc="" edc:mask="0x7" edc:name="PWMIP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="12"/>
              <edc:SFRFieldDef edc:cname="PWMIP0" edc:desc="" edc:mask="0x1" edc:name="PWMIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWMIP1" edc:desc="" edc:mask="0x1" edc:name="PWMIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWMIP2" edc:desc="" edc:mask="0x1" edc:name="PWMIP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn---------nnn" edc:cname="IPC10" edc:desc="" edc:impl="0x7007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuu---------uuu" edc:name="IPC10" edc:nzwidth="0x10" edc:por="-100---------100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="QEIIP" edc:desc="" edc:mask="0x7" edc:name="QEIIP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="FLTAIP" edc:desc="" edc:mask="0x7" edc:name="FLTAIP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="QEIIP0" edc:desc="" edc:mask="0x1" edc:name="QEIIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIIP1" edc:desc="" edc:mask="0x1" edc:name="QEIIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIIP2" edc:desc="" edc:mask="0x1" edc:name="QEIIP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="FLTAIP0" edc:desc="" edc:mask="0x1" edc:name="FLTAIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTAIP1" edc:desc="" edc:mask="0x1" edc:name="FLTAIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTAIP2" edc:desc="" edc:mask="0x1" edc:name="FLTAIP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="rn--rrrr--rrrrrr" edc:cname="INTTREG" edc:desc="" edc:impl="0xcf3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000--000000" edc:name="INTTREG" edc:nzwidth="0x10" edc:por="00--0000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VECNUM" edc:desc="" edc:mask="0x3f" edc:name="VECNUM" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ILR" edc:desc="" edc:mask="0xf" edc:name="ILR" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TMODE" edc:desc="" edc:mask="0x1" edc:name="TMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQTOCPU" edc:desc="" edc:mask="0x1" edc:name="IRQTOCPU" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VECNUM0" edc:desc="" edc:mask="0x1" edc:name="VECNUM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM1" edc:desc="" edc:mask="0x1" edc:name="VECNUM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM2" edc:desc="" edc:mask="0x1" edc:name="VECNUM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM3" edc:desc="" edc:mask="0x1" edc:name="VECNUM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM4" edc:desc="" edc:mask="0x1" edc:name="VECNUM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM5" edc:desc="" edc:mask="0x1" edc:name="VECNUM5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ILR0" edc:desc="" edc:mask="0x1" edc:name="ILR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR1" edc:desc="" edc:mask="0x1" edc:name="ILR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR2" edc:desc="" edc:mask="0x1" edc:name="ILR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR3" edc:desc="" edc:mask="0x1" edc:name="ILR3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="CNEN1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="CNEN1" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0IE" edc:desc="" edc:mask="0x1" edc:name="CN0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1IE" edc:desc="" edc:mask="0x1" edc:name="CN1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2IE" edc:desc="" edc:mask="0x1" edc:name="CN2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3IE" edc:desc="" edc:mask="0x1" edc:name="CN3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4IE" edc:desc="" edc:mask="0x1" edc:name="CN4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5IE" edc:desc="" edc:mask="0x1" edc:name="CN5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6IE" edc:desc="" edc:mask="0x1" edc:name="CN6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7IE" edc:desc="" edc:mask="0x1" edc:name="CN7IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="CNPU1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="CNPU1" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0PUE" edc:desc="" edc:mask="0x1" edc:name="CN0PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1PUE" edc:desc="" edc:mask="0x1" edc:name="CN1PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2PUE" edc:desc="" edc:mask="0x1" edc:name="CN2PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3PUE" edc:desc="" edc:mask="0x1" edc:name="CN3PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4PUE" edc:desc="" edc:mask="0x1" edc:name="CN4PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5PUE" edc:desc="" edc:mask="0x1" edc:name="CN5PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6PUE" edc:desc="" edc:mask="0x1" edc:name="CN6PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7PUE" edc:desc="" edc:mask="0x1" edc:name="CN7PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="58"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PR1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PR1" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n------nnn-nn-" edc:cname="T1CON" edc:desc="" edc:impl="0xa076" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0------uuu-uu-" edc:name="T1CON" edc:nzwidth="0x10" edc:por="0-0------000-00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSYNC" edc:desc="" edc:mask="0x1" edc:name="TSYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="TIMER1" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR3HLD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR3HLD" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3HLD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR3HLD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PR2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PR2" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PR2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PR3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PR3" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR3" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PR3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n------nnnn-n-" edc:cname="T2CON" edc:desc="" edc:impl="0xa07a" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0------uuuu-u-" edc:name="T2CON" edc:nzwidth="0x10" edc:por="0-0------0000-0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="TIMER2" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n------nnn--n-" edc:cname="T3CON" edc:desc="" edc:impl="0xa072" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0------uuu--u-" edc:name="T3CON" edc:nzwidth="0x10" edc:por="0-0------000--0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="TIMER3" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:SFRDef edc:access="nnnrnnnnnnnnnnnn" edc:cname="QEICON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuxxxuuuxxuuu" edc:name="QEICON" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UPDN_CNT" edc:desc="" edc:mask="0x1" edc:name="UPDN_CNT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCS" edc:desc="" edc:mask="0x1" edc:name="TQCS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POSRES" edc:desc="" edc:mask="0x1" edc:name="POSRES" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS" edc:desc="" edc:mask="0x3" edc:name="TQCKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TQGATE" edc:desc="" edc:mask="0x1" edc:name="TQGATE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCDOUT" edc:desc="" edc:mask="0x1" edc:name="PCDOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWPAB" edc:desc="" edc:mask="0x1" edc:name="SWPAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM" edc:desc="" edc:mask="0x7" edc:name="QEIM" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="UPDN" edc:desc="" edc:mask="0x1" edc:name="UPDN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INDX" edc:desc="" edc:mask="0x1" edc:name="INDX" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CNTERR" edc:desc="" edc:mask="0x1" edc:name="CNTERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TQCKPS0" edc:desc="" edc:mask="0x1" edc:name="TQCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS1" edc:desc="" edc:mask="0x1" edc:name="TQCKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEIM0" edc:desc="" edc:mask="0x1" edc:name="QEIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIM1" edc:desc="" edc:mask="0x1" edc:name="QEIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIM2" edc:desc="" edc:mask="0x1" edc:name="QEIM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="QEI" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnn----" edc:cname="DFLTCON" edc:desc="" edc:impl="0x7f0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----xxuuxxx----" edc:name="DFLTCON" edc:nzwidth="0x10" edc:por="-----0000000----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="QECK" edc:desc="" edc:mask="0x7" edc:name="QECK" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="QEOUT" edc:desc="" edc:mask="0x1" edc:name="QEOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CEID" edc:desc="" edc:mask="0x1" edc:name="CEID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IMV" edc:desc="" edc:mask="0x3" edc:name="IMV" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="QECK0" edc:desc="" edc:mask="0x1" edc:name="QECK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QECK1" edc:desc="" edc:mask="0x1" edc:name="QECK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QECK2" edc:desc="" edc:mask="0x1" edc:name="QECK2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IMV0" edc:desc="" edc:mask="0x1" edc:name="IMV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IMV1" edc:desc="" edc:mask="0x1" edc:name="IMV1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
