balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F2010E.PIC
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="IC8BUF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="IC8BUF" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC8BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="IC8BUF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n-----nnnrrnnn" edc:cname="IC8CON" edc:desc="" edc:impl="0x20ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0-----00000000" edc:name="IC8CON" edc:nzwidth="0x10" edc:por="--0-----00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="ICM" edc:desc="" edc:mask="0x7" edc:name="ICM" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="ICI" edc:desc="" edc:mask="0x3" edc:name="ICI" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="ICTMR" edc:desc="" edc:mask="0x1" edc:name="ICTMR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="ICSIDL" edc:desc="" edc:mask="0x1" edc:name="ICSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICM0" edc:desc="" edc:mask="0x1" edc:name="ICM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICM1" edc:desc="" edc:mask="0x1" edc:name="ICM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICM2" edc:desc="" edc:mask="0x1" edc:name="ICM2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ICI0" edc:desc="" edc:mask="0x1" edc:name="ICI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICI1" edc:desc="" edc:mask="0x1" edc:name="ICI1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="INPUT CAPTURE 8" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="32"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OC1RS" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OC1RS" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC1RS" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="OC1RS" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OC1R" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OC1R" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC1R" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="OC1R" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n--------rnnnn" edc:cname="OC1CON" edc:desc="" edc:impl="0x201f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OC1CON" edc:nzwidth="0x10" edc:por="--0--------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="OCM" edc:desc="" edc:mask="0x7" edc:name="OCM" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCTSEL" edc:desc="" edc:mask="0x1" edc:name="OCTSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCFLT" edc:desc="" edc:mask="0x1" edc:name="OCFLT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCSIDL" edc:desc="" edc:mask="0x1" edc:name="OCSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCM0" edc:desc="" edc:mask="0x1" edc:name="OCM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM1" edc:desc="" edc:mask="0x1" edc:name="OCM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM2" edc:desc="" edc:mask="0x1" edc:name="OCM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="OUTPUT COMPARE 1" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OC2RS" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OC2RS" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC2RS" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="OC2RS" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OC2R" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OC2R" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC2R" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="OC2R" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n--------rnnnn" edc:cname="OC2CON" edc:desc="" edc:impl="0x201f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0--------00000" edc:name="OC2CON" edc:nzwidth="0x10" edc:por="--0--------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="OCM" edc:desc="" edc:mask="0x7" edc:name="OCM" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCTSEL" edc:desc="" edc:mask="0x1" edc:name="OCTSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCFLT" edc:desc="" edc:mask="0x1" edc:name="OCFLT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCSIDL" edc:desc="" edc:mask="0x1" edc:name="OCSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCM0" edc:desc="" edc:mask="0x1" edc:name="OCM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM1" edc:desc="" edc:mask="0x1" edc:name="OCM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM2" edc:desc="" edc:mask="0x1" edc:name="OCM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="OUTPUT COMPARE 2" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="52"/>
        <edc:SFRDef edc:access="n-n-----nnnnnnnn" edc:cname="PTCON" edc:desc="" edc:impl="0xa0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-----00000000" edc:name="PTCON" edc:nzwidth="0x10" edc:por="0-0-----00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTMOD" edc:desc="" edc:mask="0x3" edc:name="PTMOD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PTCKPS" edc:desc="" edc:mask="0x3" edc:name="PTCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PTOPS" edc:desc="" edc:mask="0xf" edc:name="PTOPS" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PTSIDL" edc:desc="" edc:mask="0x1" edc:name="PTSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTEN" edc:desc="" edc:mask="0x1" edc:name="PTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PTMOD0" edc:desc="" edc:mask="0x1" edc:name="PTMOD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTMOD1" edc:desc="" edc:mask="0x1" edc:name="PTMOD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS0" edc:desc="" edc:mask="0x1" edc:name="PTCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS1" edc:desc="" edc:mask="0x1" edc:name="PTCKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS0" edc:desc="" edc:mask="0x1" edc:name="PTOPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS1" edc:desc="" edc:mask="0x1" edc:name="PTOPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS2" edc:desc="" edc:mask="0x1" edc:name="PTOPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS3" edc:desc="" edc:mask="0x1" edc:name="PTOPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="PWM" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnnnnnnnnnnnn" edc:cname="PTMR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PTMR" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="PTMR" edc:desc="" edc:mask="0x7fff" edc:name="PTMR" edc:nzwidth="0xf"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="PTDIR" edc:desc="" edc:mask="0x1" edc:name="PTDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnnnnnnnnnn" edc:cname="PTPER" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-111111111111111" edc:name="PTPER" edc:nzwidth="0x10" edc:por="-111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="PTPER" edc:desc="" edc:mask="0x7fff" edc:name="PTPER" edc:nzwidth="0xf"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SEVTCMP" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SEVTCMP" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="SEVTCMP" edc:desc="" edc:mask="0x7fff" edc:name="SEVTCMP" edc:nzwidth="0xf"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="SEVTDIR" edc:desc="" edc:mask="0x1" edc:name="SEVTDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="PWMCON1" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----111100000000" edc:name="PWMCON1" edc:nzwidth="0x10" edc:por="----1111qqqqqqqq">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEN1L" edc:desc="" edc:mask="0x1" edc:name="PEN1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN2L" edc:desc="" edc:mask="0x1" edc:name="PEN2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN3L" edc:desc="" edc:mask="0x1" edc:name="PEN3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN4L" edc:desc="" edc:mask="0x1" edc:name="PEN4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN1H" edc:desc="" edc:mask="0x1" edc:name="PEN1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN2H" edc:desc="" edc:mask="0x1" edc:name="PEN2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN3H" edc:desc="" edc:mask="0x1" edc:name="PEN3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN4H" edc:desc="" edc:mask="0x1" edc:name="PEN4H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD1" edc:desc="" edc:mask="0x1" edc:name="PTMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD2" edc:desc="" edc:mask="0x1" edc:name="PTMOD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD3" edc:desc="" edc:mask="0x1" edc:name="PTMOD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD4" edc:desc="" edc:mask="0x1" edc:name="PTMOD4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PMOD1" edc:desc="" edc:mask="0x1" edc:name="PMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD2" edc:desc="" edc:mask="0x1" edc:name="PMOD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD3" edc:desc="" edc:mask="0x1" edc:name="PMOD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD4" edc:desc="" edc:mask="0x1" edc:name="PMOD4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
