balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F2010E.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADPCFG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADPCFG" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG" edc:desc="" edc:mask="0xffff" edc:name="PCFG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG4" edc:desc="" edc:mask="0x1" edc:name="PCFG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG5" edc:desc="" edc:mask="0x1" edc:name="PCFG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG6" edc:desc="" edc:mask="0x1" edc:name="PCFG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG7" edc:desc="" edc:mask="0x1" edc:name="PCFG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG8" edc:desc="" edc:mask="0x1" edc:name="PCFG8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG9" edc:desc="" edc:mask="0x1" edc:name="PCFG9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG10" edc:desc="" edc:mask="0x1" edc:name="PCFG10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG11" edc:desc="" edc:mask="0x1" edc:name="PCFG11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG12" edc:desc="" edc:mask="0x1" edc:name="PCFG12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG13" edc:desc="" edc:mask="0x1" edc:name="PCFG13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG14" edc:desc="" edc:mask="0x1" edc:name="PCFG14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG15" edc:desc="" edc:mask="0x1" edc:name="PCFG15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCSSL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCSSL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSSL" edc:desc="" edc:mask="0xffff" edc:name="CSSL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CSSL0" edc:desc="" edc:mask="0x1" edc:name="CSSL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL1" edc:desc="" edc:mask="0x1" edc:name="CSSL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL2" edc:desc="" edc:mask="0x1" edc:name="CSSL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL3" edc:desc="" edc:mask="0x1" edc:name="CSSL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL4" edc:desc="" edc:mask="0x1" edc:name="CSSL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL5" edc:desc="" edc:mask="0x1" edc:name="CSSL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL6" edc:desc="" edc:mask="0x1" edc:name="CSSL6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL7" edc:desc="" edc:mask="0x1" edc:name="CSSL7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL8" edc:desc="" edc:mask="0x1" edc:name="CSSL8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL9" edc:desc="" edc:mask="0x1" edc:name="CSSL9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL10" edc:desc="" edc:mask="0x1" edc:name="CSSL10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL11" edc:desc="" edc:mask="0x1" edc:name="CSSL11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL12" edc:desc="" edc:mask="0x1" edc:name="CSSL12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL13" edc:desc="" edc:mask="0x1" edc:name="CSSL13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL14" edc:desc="" edc:mask="0x1" edc:name="CSSL14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL15" edc:desc="" edc:mask="0x1" edc:name="CSSL15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="26"/>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="TRISB" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:mask="0xffff" edc:name="TRISB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------uuuuuu" edc:name="PORTB" edc:nzwidth="0x10" edc:por="----------xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0xffff" edc:name="RB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
